// 台股相關題目 (傑尼龜)
const twStockQuestions = [
  {
    question: "台股一般較易時間(不含盤後)何時結束?",
    options: ["1.13:00", "2.13:30", "3.14:30"],
    answer: 2,
    hint: "比銀行的三點半關門早兩個小時。",
  },
  {
    question: "台灣最著名的「護國神山」是指哪間公司？",
    options: ["1.台積電", "2.聯發科", "3.鴻海"],
    answer: 1,
    hint: "代號2330。",
  },
  {
    question: "台股買賣一張等於多少股？",
    options: ["1.100", "2.500", "3.1000"],
    answer: 3,
    hint: "以千為單位。",
  },
  {
    question: "股票漲停板是指股價相較前一天最高上漲了多少？",
    options: ["1.5%", "2.10%", "3.15%"],
    answer: 2,
    hint: "10是個好數字。",
  },
  {
    question: "買入股票後,銀行會在第幾個營業日進行扣款？",
    options: ["1.T+1", "2.T+2", "3.T+3"],
    answer: 2,
    hint: "成交的後天扣款。",
  },
  {
    question: "台股中的三大法人不包含哪個？",
    options: ["1.外資", "2.投信", "3.散戶"],
    answer: 3,
    hint: "法人是機構。",
  },
  {
    question: "哪種交易可以在13:30收盤後進行交易？",
    options: ["1.盤後定額交易", "2.盤中零股交易", "3.競價交易"],
    answer: 1,
    hint: "下午兩點後用收盤價買進。",
  },
  {
    question: "在台股賣出股票時需要繳納什麼稅給政府？",
    options: ["1.所得稅", "2.營業稅", "3.證交稅"],
    answer: 3,
    hint: "交易股票。",
  },
  {
    question: "想要買進不滿1000股,要透過捨麼方式？",
    options: ["1.零股交易", "2.期貨交易", "3.信用交易"],
    answer: 1,
    hint: "還是股票。",
  },
];

// 加密貨幣相關題目 (小火龍)
const cryptoQuestions = [
  {
    question: "比特幣發明者是？",
    options: ["1.中本聰", "2.馬斯克", "3.巴菲特"],
    answer: 1,
    hint: "比特幣的單位為聰。",
  },
  {
    question: "資產放在哪裡最安全？",
    options: ["1.冷錢包", "2.交易所", "3.銀行"],
    answer: 1,
    hint: "離線保管才是安全的。",
  },
  {
    question: "加密貨幣的交易時間？",
    options: ["1.全年無休", "2.周一至周五", "3.每天上午9點到下午5點"],
    answer: 1,
    hint: "代碼沒有假期,市場不關門。",
  },
  {
    question: "穩定幣是什麼？",
    options: ["1.個人發行的貨幣", "2.與掛勾法幣的貨幣", "3.高度波動的貨幣"],
    answer: 2,
    hint: "價值錨定美元以應對波動。",
  },
  {
    question: "助記詞有多少單字？",
    options: ["1.8或24", "2.12或24", "3.8或12"],
    answer: 2,
    hint: "12的倍數。",
  },
  {
    question: "加密貨幣的不可竄改性是靠什麼？",
    options: ["1.法律", "2.共識機制", "3.中心化"],
    answer: 2,
    hint: "靠網路過半的節點共同確認。",
  },
  {
    question: "轉帳的手續費叫？",
    options: ["1.服務費", "2.租金", "3.Gas Fee"],
    answer: 3,
    hint: "維持運轉的燃料。",
  },
  {
    question: "助記詞外流會發生什麼？",
    options: ["1.增加安全性", "2.沒事", "3.資產被轉走"],
    answer: 3,
    hint: "誰握有單字,誰就是主人。",
  },
    {
    question: "可公開轉帳用的是？",
    options: ["1.助記詞", "2.私鑰", "3.錢包地址"],
    answer: 3,
    hint: "像是收件地址一樣。",
  },
];

// 美股相關題目 (伊布)
const usStockQuestions = [
  {
    question: "美股最基本的交易單位是多少股？",
    options: ["1. 1股", "2. 10股", "3. 1000股"],
    answer: 1,
    hint: "最小的單位就可以當股東。",
  },
  {
    question: "道瓊工業指數包含多少家公司？",
    options: ["1.30家", "2.40家", "3.50家"],
    answer: 1,
    hint: "古老的指數只挑30家龍頭。",
  },
  {
    question: "哪家公司不屬於美股著名的科技七巨頭？",
    options: ["1.麥當勞", "2.蘋果", "3.特斯拉"],
    answer: 1,
    hint: "聽過科技麥當勞?",
  },
  {
    question: "美股是否有與台股一樣的漲跌停百分比限制？",
    options: ["1.有", "2.沒有", "3.只有跌停限制"],
    answer: 2,
    hint: "多空雙方充分博弈。",
  },
  {
    question: "美國公司每一季公布的EPS代表麼？",
    options: ["1.每股股價", "2.每股盈餘", "3.每股稅金"],
    answer: 2,
    hint: "代表每一股賺了多少錢。",
  },
  {
    question: "' 美股大盤短時間內跌幅過大市場會暫停交易這稱為什麼？",
    options: ["1.平準機制", "2.熔斷機制", "3.暫停制度"],
    answer: 2,
    hint: "像保險絲燒斷。",
  },
  {
    question: "標普500指數主要追蹤什麼？",
    options: ["1.科技股表現", "2.銀行股表現", "3.前500大公司上市公司"],
    answer: 3,
    hint: "名子說明了一切。",
  },
  {
    question:"在美股收到的股息要繳納多少的股息稅？",
    options: ["1.15%", "2.20%", "3.30%"],
    answer: 3,
    hint: "稅率挺高的。",
  },
  {
    question: "美國上市公司每過多久要公布一次正式的財務報表？",
    options: ["1.每個月", "2.每年", "3.每季"],
    answer: 3,
    hint: "每三個月檢視一次。",
  },
];